{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv1_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv1_1/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv1_2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2_2/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv3_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv3_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv3_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_3/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of2", "group8-shard2of2"], "weights": [{"name": "conv4_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv4_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group9-shard1of3", "group9-shard2of3", "group9-shard3of3"], "weights": [{"name": "conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group10-shard1of3", "group10-shard2of3", "group10-shard3of3"], "weights": [{"name": "conv4_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group11-shard1of3", "group11-shard2of3", "group11-shard3of3"], "weights": [{"name": "conv5_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group12-shard1of3", "group12-shard2of3", "group12-shard3of3"], "weights": [{"name": "conv5_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group13-shard1of3", "group13-shard2of3", "group13-shard3of3"], "weights": [{"name": "conv5_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group14-shard1of5", "group14-shard2of5", "group14-shard3of5", "group14-shard4of5", "group14-shard5of5"], "weights": [{"name": "fc6/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "fc6/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group15-shard1of2", "group15-shard2of2"], "weights": [{"name": "fc7/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "fc7/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv6_1/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv6_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of2", "group17-shard2of2"], "weights": [{"name": "conv6_2/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv6_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv7_1/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv7_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv7_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv7_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv8_1/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv8_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv8_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv8_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv9_1/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv9_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv9_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv9_2/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv4_3_norm/weights_0", "shape": [512], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv4_3_norm_mbox_loc/kernel", "shape": [3, 3, 512, 16], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_loc/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group26-shard1of2", "group26-shard2of2"], "weights": [{"name": "conv4_3_norm_mbox_conf/kernel", "shape": [3, 3, 512, 324], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_conf/bias", "shape": [324], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "fc7_mbox_loc/kernel", "shape": [3, 3, 1024, 24], "dtype": "float32"}, {"name": "fc7_mbox_loc/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group28-shard1of5", "group28-shard2of5", "group28-shard3of5", "group28-shard4of5", "group28-shard5of5"], "weights": [{"name": "fc7_mbox_conf/kernel", "shape": [3, 3, 1024, 486], "dtype": "float32"}, {"name": "fc7_mbox_conf/bias", "shape": [486], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "conv6_2_mbox_loc/kernel", "shape": [3, 3, 512, 24], "dtype": "float32"}, {"name": "conv6_2_mbox_loc/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group30-shard1of3", "group30-shard2of3", "group30-shard3of3"], "weights": [{"name": "conv6_2_mbox_conf/kernel", "shape": [3, 3, 512, 486], "dtype": "float32"}, {"name": "conv6_2_mbox_conf/bias", "shape": [486], "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"name": "conv7_2_mbox_loc/kernel", "shape": [3, 3, 256, 24], "dtype": "float32"}, {"name": "conv7_2_mbox_loc/bias", "shape": [24], "dtype": "float32"}]}, {"paths": ["group32-shard1of2", "group32-shard2of2"], "weights": [{"name": "conv7_2_mbox_conf/kernel", "shape": [3, 3, 256, 486], "dtype": "float32"}, {"name": "conv7_2_mbox_conf/bias", "shape": [486], "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"name": "conv8_2_mbox_loc/kernel", "shape": [3, 3, 256, 16], "dtype": "float32"}, {"name": "conv8_2_mbox_loc/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"name": "conv8_2_mbox_conf/kernel", "shape": [3, 3, 256, 324], "dtype": "float32"}, {"name": "conv8_2_mbox_conf/bias", "shape": [324], "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"name": "conv9_2_mbox_loc/kernel", "shape": [3, 3, 256, 16], "dtype": "float32"}, {"name": "conv9_2_mbox_loc/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"name": "conv9_2_mbox_conf/kernel", "shape": [3, 3, 256, 324], "dtype": "float32"}, {"name": "conv9_2_mbox_conf/bias", "shape": [324], "dtype": "float32"}]}]}